var DATA = {
    text: ["我：zzzZZZ", "我：嗯？又把选修课睡过去了？晚上没课直接回家吧", "【今天怎样回家？】"],
    role: [],
    roleChange: [0],
    background: ["bg-street.jpg"],
    bgChange: [1],
    choose: [{
        "走回家": {
            text: ["正值春天，沿路的樱花树的确让人感到惬意", "这时候，一个身影吸引住你的眼球", "【我：好萌的妹子啊，要上去勾搭吗？】"],
            role: ["", "0-1.png"],
            roleChange: [1, 2],
            background: ["bg-street.jpg"],
            choose: [{
                "二话不说马上去": {
                    text: ["当正要踏出右脚时，你的脑袋被秒速五公里的樱花击中了", "在医院一趟就是30年，真是可喜可贺。"],
                    role: [],
                    roleChange: [],
                    background: ["bg-street.jpg"],
                    bgChange: [1],
                    end: {
                        title: "睡到天荒地老",
                        CG: "",
                        endId: "71041"
                    }
                },
                "远远望着就可以了": {
                    text: ["目送她远去之后你回到了自己的家里", "   回想那轻盈的身影与背景融为一体，仿佛画一般", " 不知道还有没有机会见到她呢", "五个月后", "我：啊，饿了", "【要找点吃的了】"],
                    role: [],
                    roleChange: [],
                    background: ["bg-room.jpg"],
                    bgChange: [1],
                    choose: [{
                        "叫外卖": {
                            text: ["半小时后，门铃响了", "打开门，出现在眼前的是一个奇怪的生物", "浑身是肌肉……", "？？：恭喜你是我们店今天第100位顾客", "？？：奖励你一张BML的门票！7月底记得去看哦！", "我：excuseme？你居然还会讲话啊？", "？？：我叫小电视，和我签订契约成为魔法少女吧", "我：请您这位QB别露出那么多肌肉好吗", "小电视：那么，后会有期(<ゝω·)☆~", "我：……", "翌日一大早家里", "我：唔……是谁？", "？？：是我是我", "我：……这不是，小电视么", "我：你怎么进来的？！", "小电视：我看你还没醒来，就决定从窗户钻进来了", "我：只有岛田家的人才会爬墙，你究竟是谁", "小电视：嘿嘿嘿，区区12楼根本阻挡不了我想见到你的心", "【小电视：那么你想先吃饭，先洗澡，还是先~吃~我~？】"],
                            role: ["", "3-1.png", "", "3-2.png"],
                            roleChange: [1, 4, 9, 13],
                            background: ["bg-room.jpg"],
                            choose: [{
                                "先吃饭": {
                                    text: ["小电视：没情趣嘛，看来只能我霸王硬上弓了", "于是你，人生第一次——", "被壁咚"],
                                    role: ["3-3.png"],
                                    roleChange: [1],
                                    background: ["bg-room.jpg"],
                                    bgChange: [1],
                                    end: {
                                        title: "壁咚初体验",
                                        CG: "tv.png",
                                        endId: "71046"
                                    }
                                },
                                "先洗澡": {
                                    text: ["小电视：哎呀，不用那么麻烦啦", "小电视：就现在吧！", "于是你，人生第一次——", "被壁咚"],
                                    role: ["3-3.png"],
                                    roleChange: [1],
                                    background: ["bg-room.jpg"],
                                    bgChange: [1],
                                    end: {
                                        title: "壁咚初体验",
                                        CG: "tv.png",
                                        endId: "71046"
                                    }
                                },
                                "先吃小电视": {
                                    text: ["[先吃小电视]", "于是——你把小电视吃了", "警察蜀黍破门而入把你抓起来", "你被关了30年，真是可喜可贺"],
                                    role: [""],
                                    roleChange: [1],
                                    background: ["bg-room.jpg"],
                                    bgChange: [1],
                                    end: {
                                        title: "饥不择食 ",
                                        CG: "",
                                        endId: "71047"
                                    }
                                }
                            }]
                        },
                        "到便利店买": {
                            text: ["我：虽然天气很热，还是出来买些吃的吧。", "我：不晒晒太阳，怀疑自己都快要长蘑菇了", "【？？：啊，该吃什么好呢？】"],
                            role: ["", "0-3.png"],
                            roleChange: [1, 3],
                            background: ["bg-CVS.jpg"],
                            bgChange: [1],
                            choose: [{
                                "上前给与建议": {
                                    text: ["我：这个咖喱饭挺好吃的，可以试一下", "？？：谢谢！！选择恐惧的我已经在这纠结半小时了_(:3」∠)_", "22：啊，还没自我介绍，我叫22。", "22：我们以前见面过吗？", "我：应该没吧，难道你是哔哩哔哩中学的？", "22：嗯嗯，是啊，难道你也是？", "我：对啊对啊，没想到在这里也能遇到校友:D", "22：是呢:)", "（迷之尴尬了一下，但我还是鼓起了勇气）", "我：能……能不能给一个你的联系方式？", "22：可以啊，之后有机会再聊吧，我先回家啦", "我：一不小心买得也太多了", "【接下来该去哪呢】"],
                                    role: ["", "2-3.png", ""],
                                    roleChange: [1, 2, 12],
                                    background: ["bg-CVS.jpg"],
                                    bgChange: [1],
                                    choose: [{
                                        "回家": {
                                            text: ["回到家，拿了快递", "我：我最近好像没清过购物车啊", "我：这份快递是……？", "我：BML门票？还是两张？！", "我：会不会是发错了？", "我：后面还有张纸条——", "「收到这份礼物的你，不要担心，这份快递没有发错」", "「你是被选中的孩子，希望你能在BML中——」", "「享受愉悦，找到真爱」", "【那么问题来了，我要和谁去】"],
                                            role: [],
                                            roleChange: [],
                                            background: ["bg-room.jpg"],
                                            bgChange: [1],
                                            choose: [{
                                                22: {
                                                    text: ["你忐忑不安地发了邀请的短息给22之后，不多久就收到了她的回复", "22：没问题啊，那天我有空！> <", "于是在热得让人窒息的这一天", "我和22一起来到了BML现场", "演出很精彩", "但是我目光不光只是注视着舞台", "坐在我身旁的22", "一直充满活力打call应援的她", "每个动作都吸引着我", "有点天然呆的她", "让我觉得有一种幸福感", "22：太棒啦！太难忘了！", "我：看你激动得，我就知道带你来是最合适的", "22：嘿嘿，说得你好像有其他人能选一样的~", "我：啧，被看穿了", "22：对了，过两周有个夏夜的祭典", "22：你有空和我一块去吗？和你待一起觉得很开心", "我：！好！", "夏夜祭典，如期而至星空夜晚", "我和她，也如期相见", "我：有个人说过，夏夜是一年中最浪漫的夜晚", "我：今晚居然能见到久违的星空", "今晚的夏季大三角特别的明显", "22：看到了吗，牛郎星和织女星", "22：今天七夕可是他们相见的日子呢", "我：那么，你愿意成为我的织女星吗", "22：我不要和你相隔16光年", "22：……只要能陪在你身边就好了"],
                                                    role: ["", "2-2.png", "", "0-3.png"],
                                                    roleChange: [1, 7, 19, 21],
                                                    background: ["bg-room.jpg", "bg-BML.jpg", "bg-night-sky.jpg"],
                                                    bgChange: [1, 3, 18],
                                                    end: {
                                                        title: "相依的星辰",
                                                        CG: "22.png",
                                                        endId: "71045"
                                                    }
                                                },
                                                "自己一个人去就好了": {
                                                    text: ["我也没太多认识的朋友", "这些机会并不属于我", "于是我其中一张票卖掉了", "独自来到BML的我，万万没想到", "坐在我旁边的两位竟然是妹子", "而且似乎还是我认识的", "难道这就是命运吗", "我：你好，你一个人来的吗？", "33：姐姐，有人向我搭讪诶……", "22：你是谁！找我妹妹干嘛！", "我：这位姐姐冷静一下，我……我是个好人……", "我：看着你们都很会打call，所以想请教一下这位可爱的妹妹", "（总觉得见过她们其中一个…不过不在意这些细节了）", "22：这男生看着应该也不是什么坏人，那就跟着我们吧", "33：嗯嗯，那我们来教你…", "之后，我们就越聊越投机，甚至还相互交换了联系方式", "从此之后，每天跟22、33分别聊天成了我一天的重要事情家里", "她们的好感度以肉眼可见的速度上涨", "一只无形的手让我做出了一件大胆的事——", "约她们一起出来", "我：（说好的约出来呢，怎么就在我家了！）", "22：为什么33也在这里！", "33：姐姐也被约出来了吗？", "我：那个……", "等待着最终审判的我，试探性地插了句话", "22：真是差劲呢，竟然想把我们都把到！", "33：姐姐，我们要怎么办", "【我该怎么做】"],
                                                    role: ["", "2-5.png", "1-2.png", "0-5.png", "", "1-3.png", "2-6.png", "1-3.png", "2-6.png"],
                                                    roleChange: [1, 9, 10, 15, 16, 22, 23, 26, 27],
                                                    background: ["bg-BML.jpg", "bg-room.jpg"],
                                                    bgChange: [1, 17],
                                                    choose: [{
                                                        "花言巧语应对": {
                                                            text: ["我：你们听我说，你们都很可爱", "我：我不忍心在你们之中抛弃任何一个", "我：要不我们一起生活下去吧", "我：我会照顾好你们的！", "22：我怀疑你这里有问题", "33：姐姐，他说得好有道理", "33：我们还是把他推了吧", "我：你们想要……？", "我：啊啊啊……！"],
                                                            role: ["", "2-3.png", "0-6.png"],
                                                            roleChange: [1, 5, 6],
                                                            background: ["bg-room.jpg"],
                                                            bgChange: [1],
                                                            end: {
                                                                title: "最终审判",
                                                                CG: "2233play.jpg",
                                                                endId: "71048"
                                                            }
                                                        },
                                                        "伺机逃跑": {
                                                            text: ["抓住了她们沉思的一瞬间", "我准备一个横跳冲到的房门", "这时候——", "烧水的水壶鸣叫了起来", "我：（这场景咋这么有既视感）", "我的身体感到了危机感", "然而——", "家里杂物太多了，一个不小心被绊倒在地", "22：啧啧啧，居然还想逃跑", "33：那你就别怪我们了…", "我：啊啊啊，不要阿……！"],
                                                            role: ["", "2-3.png", "0-6.png"],
                                                            roleChange: [1, 9, 10],
                                                            background: ["bg-room.jpg"],
                                                            bgChange: [1],
                                                            end: {
                                                                title: "最终审判",
                                                                CG: "2233play.jpg",
                                                                endId: "71048"
                                                            }
                                                        }
                                                    }]
                                                }
                                            }]
                                        },
                                        "去书店逛逛": {
                                            text: ["我：话说这个选项是怎么回事啊！", "我：一个在家长蘑菇的人居然还会去书店！", "我：不过预感在书店又能遇见妹子了", "一下子没留意，与某样东西撞上了……", "？？：啊…啊…不好意思", "？？：你没事吧", "映入眼前的是一名文学少女", "我：没事，都怪我没好好走路", "？？：不过你刚都使出前列腺刹车了，需要救护车吗", "说着她便抄起手机准备打120", "我：真的没事了，按照剧情发展不如你把联系方式留给我", "我：不然这个选项就没意义了!", "？？：选项？忘了介绍自己了，我是33", "33：如果身体还疼的话别勉强自己啊", "我：嗯，那我先回家休息一下", "回到家，拿了快递", "我：我最近好像没清过购物车啊", "我：这份快递是……？", "我：BML门票？还是两张", "我：会不会是发错了", "我：后面还有张纸条——", "「收到这份礼物的你，不要担心，这份快递没有发错」", "「你是被选中的孩子，希望你能在BML中——」", "「享受愉悦，找到真爱」", "【那么问题来了，我要和谁去】"],
                                            role: ["", "2-4.png", "0-4.png", ""],
                                            roleChange: [1, 5, 9, 16],
                                            background: ["bg-street.jpg", "bg-room.jpg"],
                                            bgChange: [1, 16],
                                            choose: [{
                                                22: {
                                                    text: ["你忐忑不安地发了邀请的短息给22之后，不多久就收到了她的回复", "22：没问题啊，那天我有空！> <", "于是在热得让人窒息的这一天", "我和22一起来到了BML现场", "演出很精彩", "但是我目光不光只是注视着舞台", "坐在我身旁的22", "一直充满活力打call应援的她", "每个动作都吸引着我", "有点天然呆的她", "让我觉得有一种幸福感", "22：太棒啦！太难忘了！", "我：看你激动得，我就知道带你来是最合适的", "22：嘿嘿，说得你好像有其他人能选一样的~", "我：啧，被看穿了", "22：对了，过两周有个夏夜的祭典", "22：你有空和我一块去吗？和你待一起觉得很开心", "我：！好！", "夏夜祭典，如期而至星空夜晚", "我和她，也如期相见", "我：有个人说过，夏夜是一年中最浪漫的夜晚", "我：今晚居然能见到久违的星空", "今晚的夏季大三角特别的明显", "22：看到了吗，牛郎星和织女星", "22：今天七夕可是他们相见的日子呢", "我：那么，你愿意成为我的织女星吗", "22：我不要和你相隔16光年", "22：……只要能陪在你身边就好了"],
                                                    role: ["", "2-2.png", "", "0-3.png"],
                                                    roleChange: [1, 7, 19, 21],
                                                    background: ["bg-room.jpg", "bg-BML.jpg", "bg-night-sky.jpg"],
                                                    bgChange: [1, 3, 18],
                                                    end: {
                                                        title: "相依的星辰",
                                                        CG: "22.png",
                                                        endId: "71045"
                                                    }
                                                },
                                                33: {
                                                    text: ["我也没太多认识的朋友", "于是碰碰运气地向33发了邀请的短信之后", "33：【嗯嗯可以的，33第一次被约出来呢（////）】", "33：【话说我多带一个妹子过去可以吗】", "我：【唔，可以是可以，不过没多余的票了】", "33：【没事，我能解决】", "我：【那好！到时见】", "炎夏的气息，热得让人窒息", "来到了BML举办当天", "我：噗！原来你们是姊妹啊！", "我：两姊妹还真的挺像的", "演出很精彩", "但是我目光不光只是注视着舞台", "坐在我身旁的33", "平时看上去很文静的她", "看到这样的表演也不禁挥动手中的荧光棒", "我心中油然而生一种幸福感", "不过她似乎目光没怎么在我身上倒是了", "我：和你们在一起很开心呢", "22、33：嗯！我们多点出来一起玩吧", "第二天，22和33约了我出门", "22：好热啊…", "33：口渴了…", "我：我去给你们买点喝的吧", "仿佛成为人生赢家的我", "一路陶醉在如何攻略22、33的幻想中", "一路小跑把冷饮买回来", "当我在回去找她们的时候——", "发现了我才是被NTR的主角！！", "而且，大概是最幸福的被NTR主角吧"],
                                                    role: ["", "0-2.png", "0-5.png", "", "1-5.png", "0-2.png", "0-5.png", ""],
                                                    roleChange: [1, 10, 11, 12, 20, 22, 23, 24],
                                                    background: ["bg-room.jpg", "bg-BML.jpg", "bg-night-sky.jpg"],
                                                    bgChange: [1, 8, 21],
                                                    end: {
                                                        title: "幸福NTR",
                                                        CG: "NTR1.png",
                                                        endId: "71049"
                                                    }
                                                },
                                                "自己一个人去就好了": {
                                                    text: ["我也没太多认识的朋友", "感觉这些机会并不属于我", "于是我发短信给22，准备把票让给她", "22：【实在太感谢了！】", "22：【话说你真的不想去看吗？】", "我：【一个人去看的话会感觉很奇怪的】", "22：【我跟你一起去看就好了！】", "我：【不过我没票了…】", "22：【没事，其实我这里还有多一张呢！】", "所谓的幸运，也许就是这样", "BML现场", "22竟然和33一起来到BML现场", "我：你们，该不会是认识的吧……", "33：22是我姐姐", "我：竟然还是姊妹！", "22：哼，认识那么多妹子竟然还不主动约出来看", "33：活该孤独一生", "演出很精彩，期间和22、33也聊了很多很多", "欢乐的时光总是过得特别快", "依依不舍地要和她们分开了", "不知道下一次什么时候才能再见到…", "22：笨蛋，又不是相隔天涯海角", "33：可以多和我们出来玩", "自此之后，与她们聊天成为我一天当中最重要的事", "最幸福的事", "与前些天一样还是夏季的白天", "今天却格外的凉爽", "我和22、33出门逛街去了", "33：姐姐，这件衣服看上去一般", "22：那这件呢！", "33：……", "33望着我", "我：我说啊，你们穿什么都好看", "【22：嘿嘿嘿，那我俩谁好看一点！】"],
                                                    role: ["", "0-5.png", "0-2.png", "0-5.png", "", "2-2.png", "1-5.png", "", "0-6.png", "0-3.png", "0-6.png", "0-3.png"],
                                                    roleChange: [1, 12, 16, 17, 18, 22, 23, 24, 29, 30, 31, 34],
                                                    background: ["bg-room.jpg", "bg-BML.jpg", "bg-street.jpg"],
                                                    bgChange: [1, 11, 26],
                                                    choose: [{
                                                        "22好看一点": {
                                                            text: ["22：yeah！22大胜利！", "33：呜呜呜", "我：哎呀33别哭啦，你们在我心中都一样重要！", "我：你们缺一不可，我们以后也要继续好好地在一起", "33：嗯~！"],
                                                            role: ["2-3.png", "0-6.png", "", "1-6.png"],
                                                            roleChange: [1, 2, 3, 5],
                                                            background: ["bg-street.jpg"],
                                                            bgChange: [1],
                                                            end: {
                                                                title: "两份的快乐",
                                                                CG: "",
                                                                endId: "71050"
                                                            }
                                                        },
                                                        "33好看一点": {
                                                            text: ["22：啊啊啊，不理你了！", "33：抱抱姐姐", "我：别气别气！其实你们在我心中都一样重要！", "我：你们缺一不可，我希望以后也能和你们好好地在一起", "22：哼，请我吃冷饮就放你一马", "33：我也要"],
                                                            role: ["1-3.png", "1-6.png", "", "0-3.png", "1-6.png"],
                                                            roleChange: [1, 2, 3, 5, 6],
                                                            background: ["bg-street.jpg"],
                                                            bgChange: [1],
                                                            end: {
                                                                title: "两份的快乐",
                                                                CG: "",
                                                                endId: "71050"
                                                            }
                                                        },
                                                        "都好看": {
                                                            text: ["我：你们都那么好看，在我心中都一样重要", "我：我付出两倍、三倍、2233倍的努力", "我：能跟你们在一起都是值得的", "我：这就是我最大的幸福", "我：能拥有你们这双美丽的翅膀"],
                                                            role: [""],
                                                            roleChange: [],
                                                            background: ["bg-street.jpg"],
                                                            bgChange: [1],
                                                            end: {
                                                                title: "你们都是我的翅膀",
                                                                CG: "2233.png",
                                                                endId: "71051"
                                                            }
                                                        }
                                                    }]
                                                }
                                            }]
                                        }
                                    }]
                                },
                                "自己买自己的就好了": {
                                    text: ["我：随便去勾搭妹子说不定会被认为是变态呢", "我赶紧买好东西吃完就撤", "我：买得也太多了", "【接下来该去哪呢】"],
                                    role: [],
                                    roleChange: [],
                                    background: ["bg-CVS.jpg"],
                                    bgChange: [1],
                                    choose: [{
                                        "回家": {
                                            text: ["？？：噢，命中注定与我相见的人啊", "我：……？请问您是哪位？", "？？：大家好，我是小电视", "小电视：少侠一路上如此黯然", "小电视：想必是万中无一的练武奇才", "我：《如来神掌》我家有了", "小电视：和我签订契约，成为魔法少女吧", "我：看来我还要练一下《葵花宝典》才可以吧", "我：那你先领教一下我从天而降的掌法", "小电视：我们后会有期！我先去打救别的迷途的羔羊", "翌日一大早家里", "我：唔……是谁？", "？？：是我是我", "我：……这不是，小电视么", "我：你怎么进来的？！", "小电视：我看你还没醒来，就决定从窗户钻进来了", "我：只有岛田家的人才会爬墙，你究竟是谁", "小电视：嘿嘿嘿，区区12楼根本阻挡不了我想见到你的心", "【小电视：那么你想先吃饭，先洗澡，还是先~吃~我~？】"],
                                            role: ["3-3.png", "", "3-3.png"],
                                            roleChange: [1, 11, 13],
                                            background: ["bg-street.jpg", "bg-room.jpg"],
                                            bgChange: [1, 11],
                                            choose: [{
                                                "先吃饭": {
                                                    text: ["小电视：没情趣嘛，看来只能我霸王硬上弓了", "于是你，人生第一次——", "被壁咚"],
                                                    role: ["3-3.png"],
                                                    roleChange: [1],
                                                    background: ["bg-room.jpg"],
                                                    bgChange: [1],
                                                    end: {
                                                        title: "壁咚初体验",
                                                        CG: "tv.png",
                                                        endId: "71046"
                                                    }
                                                },
                                                "先洗澡": {
                                                    text: ["小电视：哎呀，不用那么麻烦啦", "小电视：就现在吧！", "于是你，人生第一次——", "被壁咚"],
                                                    role: ["3-3.png"],
                                                    roleChange: [1],
                                                    background: ["bg-room.jpg"],
                                                    bgChange: [1],
                                                    end: {
                                                        title: "壁咚初体验",
                                                        CG: "tv.png",
                                                        endId: "71046"
                                                    }
                                                },
                                                "先吃小电视": {
                                                    text: ["于是——你把小电视吃了", "警察蜀黍破门而入把你抓起来", "你被关了30年，真是可喜可贺"],
                                                    role: [""],
                                                    roleChange: [1],
                                                    background: ["bg-room.jpg"],
                                                    bgChange: [1],
                                                    end: {
                                                        title: "饥不择食",
                                                        CG: "",
                                                        endId: "71047"
                                                    }
                                                }
                                            }]
                                        },
                                        "去书店逛逛": {
                                            text: ["我：话说这个选项是怎么回事啊！", "我：一个在家长蘑菇的人居然还会去书店！", "我：不过预感在书店又能遇见妹子了", "一下子没留意，与某样东西撞上了……", "？？：啊…啊…不好意思", "？？：你没事吧", "映入眼前的是一名文学少女", "我：没事，都怪我没好好走路", "？？：不过你刚都使出前列腺刹车了，需要救护车吗", "说着她便抄起手机准备打120", "我：真的没事了，按照剧情发展不如你把联系方式留给我", "我：不然这个选项就没意义了!", "？？：选项？忘了介绍自己了，我是33", "33：如果身体还疼的话别勉强自己啊", "我：嗯，那我先回家休息一下", "回到家，拿了快递", "我：我最近好像没清过购物车啊", "我：这份快递是……？", "我：BML门票？还是两张", "我：会不会是发错了", "我：后面还有张纸条——", "「收到这份礼物的你，不要担心，这份快递没有发错」", "「你是被选中的孩子，希望你能在BML中——」", "「享受愉悦，找到真爱」", "【那么问题来了，我要和谁去】"],
                                            role: ["", "2-4.png", "0-4.png", ""],
                                            roleChange: [1, 5, 9, 16],
                                            background: ["bg-street.jpg", "bg-room.jpg"],
                                            bgChange: [1, 16],
                                            choose: [{
                                                33: {
                                                    text: ["我也没太多认识的朋友", "于是碰碰运气地向33发了邀请的短信之后", "33：【嗯嗯可以的，33第一次被约出来呢（////）】", "33：【话说我多带一个妹子过去可以吗】", "我：【唔，可以是可以，不过没多余的票了】", "33：【没事，我能解决】", "我：【那好！到时见】", "炎夏的气息，热得让人窒息", "来到了BML举办当天", "我：噗！原来你们是姊妹啊！", "我：两姊妹还真的挺像的", "演出很精彩", "但是我目光不光只是注视着舞台", "坐在我身旁的33", "平时看上去很文静的她", "看到这样的表演也不禁挥动手中的荧光棒", "我心中油然而生一种幸福感", "不过她似乎目光没怎么在我身上倒是了", "我：和你们在一起很开心呢", "22、33：嗯！我们多点出来一起玩吧", "第二天，22和33约了我出门", "22：好热啊…", "33：口渴了…", "我：我去给你们买点喝的吧", "仿佛成为人生赢家的我", "一路陶醉在如何攻略22、33的幻想中", "一路小跑把冷饮买回来", "当我在回去找她们的时候——", "发现了我才是被NTR的主角！！", "而且，大概是最幸福的被NTR主角吧"],
                                                    role: ["", "0-2.png", "0-5.png", "", "1-5.png", "0-2.png", "0-5.png", ""],
                                                    roleChange: [1, 10, 11, 12, 20, 22, 23, 24],
                                                    background: ["bg-room.jpg", "bg-BML.jpg", "bg-night-sky.jpg"],
                                                    bgChange: [1, 8, 21],
                                                    end: {
                                                        title: "幸福NTR",
                                                        CG: "NTR1.png",
                                                        endId: "71049"
                                                    }
                                                },
                                                "自己一个人去就好了": {
                                                    text: ["我也没太多认识的朋友", "这些机会并不属于我", "于是我其中一张票卖掉了", "独自来到BML的我，万万没想到", "坐在我旁边的两位竟然是妹子", "而且似乎还是我认识的", "难道这就是命运吗", "我：你好，你一个人来的吗？", "33：姐姐，有人向我搭讪诶……", "22：你是谁！找我妹妹干嘛！", "我：这位姐姐冷静一下，我……我是个好人……", "我：看着你们都很会打call，所以想请教一下这位可爱的妹妹", "（总觉得见过她们其中一个…不过不在意这些细节了）", "22：这男生看着应该也不是什么坏人，那就跟着我们吧", "33：嗯嗯，那我们来教你…", "之后，我们就越聊越投机，甚至还相互交换了联系方式", "从此之后，每天跟22、33分别聊天成了我一天的重要事情家里", "她们的好感度以肉眼可见的速度上涨", "一只无形的手让我做出了一件大胆的事——", "约她们一起出来", "我：（说好的约出来呢，怎么就在我家了！）", "22：为什么33也在这里！", "33：姐姐也被约出来了吗？", "我：那个……", "等待着最终审判的我，试探性地插了句话", "22：真是差劲呢，竟然想把我们都把到！", "33：姐姐，我们要怎么办", "【我该怎么做】"],
                                                    role: ["", "2-5.png", "1-2.png", "0-5.png", "", "1-3.png", "2-6.png", "1-3.png", "2-6.png"],
                                                    roleChange: [1, 9, 10, 15, 16, 22, 23, 26, 27],
                                                    background: ["bg-BML.jpg", "bg-room.jpg"],
                                                    bgChange: [1, 17],
                                                    choose: [{
                                                        "花言巧语应对": {
                                                            text: ["我：你们听我说，你们都很可爱", "我：我不忍心在你们之中抛弃任何一个", "我：要不我们一起生活下去吧", "我：我会照顾好你们的！", "22：我怀疑你这里有问题", "33：姐姐，他说得好有道理", "33：我们还是把他推了吧", "我：你们想要……？", "我：啊啊啊……！"],
                                                            role: ["", "2-3.png", "0-6.png"],
                                                            roleChange: [1, 5, 6],
                                                            background: ["bg-room.jpg"],
                                                            bgChange: [1],
                                                            end: {
                                                                title: "最终审判",
                                                                CG: "2233play.jpg",
                                                                endId: "71048"
                                                            }
                                                        },
                                                        "伺机逃跑": {
                                                            text: ["抓住了她们沉思的一瞬间", "我准备一个横跳冲到的房门", "这时候——", "烧水的水壶鸣叫了起来", "我：（这场景咋这么有既视感）", "我的身体感到了危机感", "然而——", "家里杂物太多了，一个不小心被绊倒在地", "22：啧啧啧，居然还想逃跑", "33：那你就别怪我们了…", "我：啊啊啊，不要阿……！"],
                                                            role: ["", "2-3.png", "0-6.png"],
                                                            roleChange: [1, 9, 10],
                                                            background: ["bg-room.jpg"],
                                                            bgChange: [1],
                                                            end: {
                                                                title: "最终审判",
                                                                CG: "2233play.jpg",
                                                                endId: "71048"
                                                            }
                                                        }
                                                    }]
                                                }
                                            }]
                                        }
                                    }]
                                }
                            }]
                        }
                    }]
                },
                "偷偷用手机拍张照片": {
                    text: ["刚亮起屏幕，手机就提示你附近有一只皮卡丘能抓", "然而，这时候——", "手机没电了", "我：……", "靠盃啊，你搞得一塌糊涂，就像你做的任何事一样", "这手机仿佛就是你的人生写照", "拍不到妹子，也抓不到皮卡丘", "也没有人爱你"],
                    role: [],
                    roleChange: [],
                    background: ["bg-street.jpg"],
                    bgChange: [1],
                    end: {
                        title: "孤独一生",
                        CG: "",
                        endId: "71042"
                    }
                }
            }]
        },
        "乘地铁": {
            text: ["还没到上班族回家的时间，这时候地铁站台人还不算多", "前方站着一个目测不到1米5的女生，正认真看着路线指示牌", "【我：好萌的妹子啊，要上去勾搭吗？】"],
            role: ["", "0-4.png"],
            roleChange: [1, 2],
            background: ["bg-subway-station.jpg"],
            bgChange: [1],
            choose: [{
                "二话不说马上去": {
                    text: ["虽然你坐反了方向，但你还是跟着她上了那趟地铁", "就在她下车的时候，上班族也蜂拥而至，把你挤在车厢的角落", "然后你遭到人型二向箔打击", "以后你只能充气才能出门了，真是可喜可贺"],
                    role: [],
                    roleChange: [],
                    background: ["bg-subway-station.jpg"],
                    bgChange: [1],
                    end: {
                        title: "降维打击",
                        CG: "",
                        endId: "71043"
                    }
                },
                "远远望着就可以了": {
                    text: ["我：这就是恋爱的感觉吗", "时间如同凝固了一样，我原地呆站着", "竟然差点错过了末班车……", "五个月后", "我：啊，饿了", "【要找点吃的了】"],
                    role: ["0-4.png", ""],
                    roleChange: [1, 3],
                    background: ["bg-subway-station.jpg", "bg-room.jpg"],
                    bgChange: [1, 4],
                    choose: [{
                        "叫外卖": {
                            text: ["半小时后，门铃响了", "打开门，出现在眼前的是一个奇怪的生物", "浑身是肌肉……", "？？：恭喜你是我们店今天第100位顾客", "？？：奖励你一张BML的门票！7月底记得去看哦！", "我：excuseme？你居然还会讲话啊？", "？？：我叫小电视，和我签订契约成为魔法少女吧", "我：请您这位QB别露出那么多肌肉好吗", "小电视：那么，后会有期(<ゝω·)☆~", "我：……", "翌日一大早家里", "我：唔……是谁？", "？？：是我是我", "我：……这不是，小电视么", "我：你怎么进来的？！", "小电视：我看你还没醒来，就决定从窗户钻进来了", "我：只有岛田家的人才会爬墙，你究竟是谁", "小电视：嘿嘿嘿，区区12楼根本阻挡不了我想见到你的心", "【小电视：那么你想先吃饭，先洗澡，还是先~吃~我~？】"],
                            role: ["", "3-1.png", "", "3-2.png"],
                            roleChange: [1, 4, 9, 13],
                            background: ["bg-room.jpg"],
                            bgChange: [1],
                            choose: [{
                                "先吃饭": {
                                    text: ["小电视：没情趣嘛，看来只能我霸王硬上弓了", "于是你，人生第一次——", "被壁咚"],
                                    role: ["3-3.png"],
                                    roleChange: [1],
                                    background: ["bg-room.jpg"],
                                    bgChange: [1],
                                    end: {
                                        title: "壁咚初体验",
                                        CG: "tv.png",
                                        endId: "71046"
                                    }
                                },
                                "先洗澡": {
                                    text: ["小电视：哎呀，不用那么麻烦啦", "小电视：就现在吧！", "于是你，人生第一次——", "被壁咚"],
                                    role: ["3-3.png"],
                                    roleChange: [1],
                                    background: ["bg-room.jpg"],
                                    bgChange: [1],
                                    end: {
                                        title: "壁咚初体验",
                                        CG: "tv.png",
                                        endId: "71046"
                                    }
                                },
                                "先吃小电视": {
                                    text: ["[先吃小电视]", "于是——你把小电视吃了", "警察蜀黍破门而入把你抓起来", "你被关了30年，真是可喜可贺"],
                                    role: [""],
                                    roleChange: [1],
                                    background: ["bg-room.jpg"],
                                    bgChange: [1],
                                    end: {
                                        title: "饥不择食 ",
                                        CG: "",
                                        endId: "71047"
                                    }
                                }
                            }]
                        },
                        "到便利店买": {
                            text: ["我：虽然天气很热，还是出来买些吃的吧。", "我：不晒晒太阳，怀疑自己都快要长蘑菇了", "【？？：啊，该吃什么好呢？】"],
                            role: ["", "0-3.png"],
                            roleChange: [1, 3],
                            background: ["bg-CVS.jpg"],
                            bgChange: [1],
                            choose: [{
                                "上前给与建议": {
                                    text: ["我：这个咖喱饭挺好吃的，可以试一下", "？？：谢谢！！选择恐惧的我已经在这纠结半小时了_(:3」∠)_", "22：啊，还没自我介绍，我叫22。", "22：我们以前见面过吗？", "我：应该没吧，难道你是哔哩哔哩中学的？", "22：嗯嗯，是啊，难道你也是？", "我：对啊对啊，没想到在这里也能遇到校友:D", "22：是呢:)", "（迷之尴尬了一下，但我还是鼓起了勇气）", "我：能……能不能给一个你的联系方式？", "22：可以啊，之后有机会再聊吧，我先回家啦", "我：一不小心买得也太多了", "【接下来该去哪呢】"],
                                    role: ["", "2-3.png", ""],
                                    roleChange: [1, 2, 12],
                                    background: ["bg-CVS.jpg"],
                                    bgChange: [1],
                                    choose: [{
                                        "回家": {
                                            text: ["回到家，拿了快递", "我：我最近好像没清过购物车啊", "我：这份快递是……？", "我：BML门票？还是两张？！", "我：会不会是发错了？", "我：后面还有张纸条——", "「收到这份礼物的你，不要担心，这份快递没有发错」", "「你是被选中的孩子，希望你能在BML中——」", "「享受愉悦，找到真爱」", "【那么问题来了，我要和谁去】"],
                                            role: [],
                                            roleChange: [],
                                            background: ["bg-room.jpg"],
                                            bgChange: [1],
                                            choose: [{
                                                22: {
                                                    text: ["我也没太多认识的朋友", "不如碰碰运气看能不能约到22吧", "（忐忑不按地发了信息给22）", "我：！有回应了！", "22：没问题啊，那天我有空！> <", "22：不过，我多带一个妹子过去可以吗", "我：唔，可以是可以，不过没多余的票了", "22：没事，我这有！", "我：好！到时见", "22：久等了！这是我的妹妹33", "我：两姊妹还真的挺像的", "演出很精彩", "但是我目光不光只是注视着舞台", "坐在我身旁的22", "不时起来打call的她", "每个动作都吸引着我", "有点天然呆的她", "让我觉得有一种幸福感", "不过她似乎目光没怎么在我身上倒是了", "我：和你们在一起很开心呢", "22、33：嗯！我们多点出来一起玩吧", "第二天，22和33约了我出门", "22：好热啊…", "33：口渴了…", "我：我去给你们买点喝的吧", "仿佛成为人生赢家的我", "一路陶醉在如何攻略22、33的幻想中", "一路小跑把冷饮买回来", "当我在回去找她们的时候——", "发现了我才是被NTR的主角！！", "而且，大概是最幸福的被NTR主角吧"],
                                                    role: ["", "2-2.png", "1-5.png", "2-2.png", "1-3.png", "2-6.png"],
                                                    roleChange: [1, 10, 20, 21, 23, 24],
                                                    background: ["bg-room.jpg", "bg-BML.jpg", "bg-street.jpg"],
                                                    bgChange: [1, 10, 22],
                                                    end: {
                                                        title: "幸福NTR",
                                                        CG: "NTR1.png",
                                                        endId: "71049"
                                                    }
                                                },
                                                "自己一个人去就好了": {
                                                    text: ["我也没太多认识的朋友", "这些机会并不属于我", "于是我其中一张票卖掉了", "独自来到BML的我，万万没想到", "坐在我旁边的两位竟然是妹子", "而且似乎还是我认识的", "难道这就是命运吗", "我：你好，你一个人来的吗？", "33：姐姐，有人向我搭讪诶……", "22：你是谁！找我妹妹干嘛！", "我：这位姐姐冷静一下，我……我是个好人……", "我：看着你们都很会打call，所以想请教一下这位可爱的妹妹", "（总觉得见过她们其中一个…不过不在意这些细节了）", "22：这男生看着应该也不是什么坏人，那就跟着我们吧", "33：嗯嗯，那我们来教你…", "之后，我们就越聊越投机，甚至还相互交换了联系方式", "从此之后，每天跟22、33分别聊天成了我一天的重要事情家里", "她们的好感度以肉眼可见的速度上涨", "一只无形的手让我做出了一件大胆的事——", "约她们一起出来", "我：（说好的约出来呢，怎么就在我家了！）", "22：为什么33也在这里！", "33：姐姐也被约出来了吗？", "我：那个……", "等待着最终审判的我，试探性地插了句话", "22：真是差劲呢，竟然想把我们都把到！", "33：姐姐，我们要怎么办", "【我该怎么做】"],
                                                    role: ["", "2-5.png", "1-2.png", "0-5.png", "", "1-3.png", "2-6.png", "1-3.png", "2-6.png"],
                                                    roleChange: [1, 9, 10, 15, 16, 22, 23, 26, 27],
                                                    background: ["bg-BML.jpg", "bg-room.jpg"],
                                                    bgChange: [1, 17],
                                                    choose: [{
                                                        "花言巧语应对": {
                                                            text: ["我：你们听我说，你们都很可爱", "我：我不忍心在你们之中抛弃任何一个", "我：要不我们一起生活下去吧", "我：我会照顾好你们的！", "22：我怀疑你这里有问题", "33：姐姐，他说得好有道理", "33：我们还是把他推了吧", "我：你们想要……？", "我：啊啊啊……！"],
                                                            role: ["", "2-3.png", "0-6.png"],
                                                            roleChange: [1, 5, 6],
                                                            background: ["bg-room.jpg"],
                                                            bgChange: [1],
                                                            end: {
                                                                title: "最终审判",
                                                                CG: "2233play.jpg",
                                                                endId: "71048"
                                                            }
                                                        },
                                                        "伺机逃跑": {
                                                            text: ["抓住了她们沉思的一瞬间", "我准备一个横跳冲到的房门", "这时候——", "烧水的水壶鸣叫了起来", "我：（这场景咋这么有既视感）", "我的身体感到了危机感", "然而——", "家里杂物太多了，一个不小心被绊倒在地", "22：啧啧啧，居然还想逃跑", "33：那你就别怪我们了…", "我：啊啊啊，不要阿……！"],
                                                            role: ["", "2-3.png", "0-6.png"],
                                                            roleChange: [1, 9, 10],
                                                            background: ["bg-room.jpg"],
                                                            bgChange: [1],
                                                            end: {
                                                                title: "最终审判",
                                                                CG: "2233play.jpg",
                                                                endId: "71048"
                                                            }
                                                        }
                                                    }]
                                                }
                                            }]
                                        },
                                        "去书店逛逛": {
                                            text: ["我：话说这个选项是怎么回事啊！", "我：一个在家长蘑菇的人居然还会去书店！", "我：不过预感在书店又能遇见妹子了", "一下子没留意，与某样东西撞上了……", "？？：啊…啊…不好意思", "？？：你没事吧", "映入眼前的是一名文学少女", "我：没事，都怪我没好好走路", "？？：不过你刚都使出前列腺刹车了，需要救护车吗", "说着她便抄起手机准备打120", "我：真的没事了，按照剧情发展不如你把联系方式留给我", "我：不然这个选项就没意义了!", "？？：选项？忘了介绍自己了，我是33", "33：如果身体还疼的话别勉强自己啊", "我：嗯，那我先回家休息一下", "回到家，拿了快递", "我：我最近好像没清过购物车啊", "我：这份快递是……？", "我：BML门票？还是两张", "我：会不会是发错了", "我：后面还有张纸条——", "「收到这份礼物的你，不要担心，这份快递没有发错」", "「你是被选中的孩子，希望你能在BML中——」", "「享受愉悦，找到真爱」", "【那么问题来了，我要和谁去】"],
                                            role: ["", "2-4.png", "0-4.png", ""],
                                            roleChange: [1, 5, 9, 16],
                                            background: ["bg-street.jpg", "bg-room.jpg"],
                                            bgChange: [1, 16],
                                            choose: [{
                                                22: {
                                                    text: ["我也没太多认识的朋友", "不如碰碰运气看能不能约到22吧", "（忐忑不按地发了信息给22）", "我：！有回应了！", "22：没问题啊，那天我有空！> <", "22：不过，我多带一个妹子过去可以吗", "我：唔，可以是可以，不过没多余的票了", "22：没事，我这有！", "我：好！到时见", "22：久等了！这是我的妹妹33", "我：两姊妹还真的挺像的", "演出很精彩", "但是我目光不光只是注视着舞台", "坐在我身旁的22", "不时起来打call的她", "每个动作都吸引着我", "有点天然呆的她", "让我觉得有一种幸福感", "不过她似乎目光没怎么在我身上倒是了", "我：和你们在一起很开心呢", "22、33：嗯！我们多点出来一起玩吧", "第二天，22和33约了我出门", "22：好热啊…", "33：口渴了…", "我：我去给你们买点喝的吧", "仿佛成为人生赢家的我", "一路陶醉在如何攻略22、33的幻想中", "一路小跑把冷饮买回来", "当我在回去找她们的时候——", "发现了我才是被NTR的主角！！", "而且，大概是最幸福的被NTR主角吧"],
                                                    role: ["", "2-2.png", "1-5.png", "2-2.png", "1-3.png", "2-6.png"],
                                                    roleChange: [1, 10, 20, 21, 23, 24],
                                                    background: ["bg-room.jpg", "bg-BML.jpg", "bg-street.jpg"],
                                                    bgChange: [1, 10, 22],
                                                    end: {
                                                        title: "幸福NTR",
                                                        CG: "NTR1.png",
                                                        endId: "71049"
                                                    }
                                                },
                                                33: {
                                                    text: ["我忐忑不安地发了邀请的短息给33之后", "33回复说：嗯嗯可以的，33第一次被约出来呢 （////）", "于是在热得让人窒息的这一天", "我和33一起来到了BML现场", "演出很精彩", "但是我目光不光只是注视着舞台", "坐在我身旁的33", "平时看上去很文静的她", "看到这样的表演也不禁挥动手中的荧光棒", "我心中油然而生一种幸福感", "33：演出，太棒了", "我：嗯的确非常的赞", "33：话说，我们在五个月前是不是见过？", "（她当时在地铁站发现我了？）", "我：我记得读书的时候在地铁站看到了你", "我：我在原地呆滞了好久，完全被你吸引住了", "33：那个…过两周有个夏日祭典", "33：我想，和你一起去…", "我：好呀，能和你一起我觉得很开心", "夏夜祭典，如期而至", "我和她，也如期相见", "我：有个人说过，夏夜是一年中最浪漫的夜晚", "我：今晚居然能见到久违的星空", "今晚的夏季大三角特别的明显", "33：看到了吗，牛郎星和织女星", "33：今天七夕可是他们相见的日子呢", "我：那么，你愿意成为我的织女星吗", "33：我不要和你相隔16光年", "33：……只要能陪在你身边就好了"],
                                                    role: ["", "1-5.png", "1-6.png"],
                                                    roleChange: [1, 7, 21],
                                                    background: ["bg-room.jpg", "bg-BML.jpg", "bg-night-sky.jpg"],
                                                    bgChange: [1, 3, 20],
                                                    end: {
                                                        title: "相依的星辰",
                                                        CG: "33.png",
                                                        endId: "71045"
                                                    }
                                                },
                                                "自己一个人去就好了": {
                                                    text: ["我也没太多认识的朋友", "感觉这些机会并不属于我", "于是我发短信给22，准备把票让给她", "22：【实在太感谢了！】", "22：【话说你真的不想去看吗？】", "我：【一个人去看的话会感觉很奇怪的】", "22：【我跟你一起去看就好了！】", "我：【不过我没票了…】", "22：【没事，其实我这里还有多一张呢！】", "所谓的幸运，也许就是这样", "BML现场", "22竟然和33一起来到BML现场", "我：你们，该不会是认识的吧……", "33：22是我姐姐", "我：竟然还是姊妹！", "22：哼，认识那么多妹子竟然还不主动约出来看", "33：活该孤独一生", "演出很精彩，期间和22、33也聊了很多很多", "欢乐的时光总是过得特别快", "依依不舍地要和她们分开了", "不知道下一次什么时候才能再见到…", "22：笨蛋，又不是相隔天涯海角", "33：可以多和我们出来玩", "自此之后，与她们聊天成为我一天当中最重要的事", "最幸福的事", "与前些天一样还是夏季的白天", "今天却格外的凉爽", "我和22、33出门逛街去了", "33：姐姐，这件衣服看上去一般", "22：那这件呢！", "33：……", "33望着我", "我：我说啊，你们穿什么都好看", "【22：嘿嘿嘿，那我俩谁好看一点！】"],
                                                    role: ["", "0-5.png", "0-2.png", "0-5.png", "", "2-2.png", "1-5.png", "", "0-6.png", "0-3.png", "0-6.png", "0-3.png"],
                                                    roleChange: [1, 12, 16, 17, 18, 22, 23, 24, 29, 30, 31, 34],
                                                    background: ["bg-room.jpg", "bg-BML.jpg", "bg-street.jpg"],
                                                    bgChange: [1, 11, 26],
                                                    choose: [{
                                                        "22好看一点": {
                                                            text: ["22：yeah！22大胜利！", "33：呜呜呜", "我：哎呀33别哭啦，你们在我心中都一样重要！", "我：你们缺一不可，我们以后也要继续好好地在一起", "33：嗯~！"],
                                                            role: ["2-3.png", "0-6.png", "", "1-6.png"],
                                                            roleChange: [1, 2, 3, 5],
                                                            background: ["bg-street.jpg"],
                                                            bgChange: [1],
                                                            end: {
                                                                title: "两份的快乐",
                                                                CG: "",
                                                                endId: "71050"
                                                            }
                                                        },
                                                        "33好看一点": {
                                                            text: ["22：啊啊啊，不理你了！", "33：抱抱姐姐", "我：别气别气！其实你们在我心中都一样重要！", "我：你们缺一不可，我希望以后也能和你们好好地在一起", "22：哼，请我吃冷饮就放你一马", "33：我也要"],
                                                            role: ["1-3.png", "1-6.png", "", "0-3.png", "1-6.png"],
                                                            roleChange: [1, 2, 3, 5, 6],
                                                            background: ["bg-street.jpg"],
                                                            bgChange: [1],
                                                            end: {
                                                                title: "两份的快乐",
                                                                CG: "",
                                                                endId: "71050"
                                                            }
                                                        },
                                                        "都好看": {
                                                            text: ["我：你们都那么好看，在我心中都一样重要", "我：我付出两倍、三倍、2233倍的努力", "我：能跟你们在一起都是值得的", "我：这就是我最大的幸福", "我：能拥有你们这双美丽的翅膀"],
                                                            role: [""],
                                                            roleChange: [],
                                                            background: ["bg-street.jpg"],
                                                            bgChange: [1],
                                                            end: {
                                                                title: "你们都是我的翅膀",
                                                                CG: "2233.png",
                                                                endId: "71051"
                                                            }
                                                        }
                                                    }]
                                                }
                                            }]
                                        }
                                    }]
                                },
                                "自己买自己的就好了": {
                                    text: ["我：随便去勾搭妹子说不定会被认为是变态呢", "我赶紧买好东西吃完就撤", "我：买得也太多了", "【接下来该去哪呢】"],
                                    role: [],
                                    roleChange: [],
                                    background: ["bg-CVS.jpg"],
                                    bgChange: [1],
                                    choose: [{
                                        "回家": {
                                            text: ["？？：噢，命中注定与我相见的人啊", "我：……？请问您是哪位？", "？？：大家好，我是小电视", "小电视：少侠一路上如此黯然", "小电视：想必是万中无一的练武奇才", "我：《如来神掌》我家有了", "小电视：和我签订契约，成为魔法少女吧", "我：看来我还要练一下《葵花宝典》才可以吧", "我：那你先领教一下我从天而降的掌法", "小电视：我们后会有期！我先去打救别的迷途的羔羊", "翌日一大早家里", "我：唔……是谁？", "？？：是我是我", "我：……这不是，小电视么", "我：你怎么进来的？！", "小电视：我看你还没醒来，就决定从窗户钻进来了", "我：只有岛田家的人才会爬墙，你究竟是谁", "小电视：嘿嘿嘿，区区12楼根本阻挡不了我想见到你的心", "【小电视：那么你想先吃饭，先洗澡，还是先~吃~我~？】"],
                                            role: ["3-3.png", "", "3-3.png"],
                                            roleChange: [1, 11, 13],
                                            background: ["bg-street.jpg", "bg-room.jpg"],
                                            bgChange: [1, 11],
                                            choose: [{
                                                "先吃饭": {
                                                    text: ["小电视：没情趣嘛，看来只能我霸王硬上弓了", "于是你，人生第一次——", "被壁咚"],
                                                    role: ["3-3.png"],
                                                    roleChange: [1],
                                                    background: ["bg-room.jpg"],
                                                    bgChange: [1],
                                                    end: {
                                                        title: "壁咚初体验",
                                                        CG: "tv.png",
                                                        endId: "71046"
                                                    }
                                                },
                                                "先洗澡": {
                                                    text: ["小电视：哎呀，不用那么麻烦啦", "小电视：就现在吧！", "于是你，人生第一次——", "被壁咚"],
                                                    role: ["3-3.png"],
                                                    roleChange: [1],
                                                    background: ["bg-room.jpg"],
                                                    bgChange: [1],
                                                    end: {
                                                        title: "壁咚初体验",
                                                        CG: "tv.png",
                                                        endId: "71046"
                                                    }
                                                },
                                                "先吃小电视": {
                                                    text: ["于是——你把小电视吃了", "警察蜀黍破门而入把你抓起来", "你被关了30年，真是可喜可贺"],
                                                    role: [""],
                                                    roleChange: [1],
                                                    background: ["bg-room.jpg"],
                                                    bgChange: [1],
                                                    end: {
                                                        title: "饥不择食",
                                                        CG: "",
                                                        endId: "71047"
                                                    }
                                                }
                                            }]
                                        },
                                        "去书店逛逛": {
                                            text: ["我：话说这个选项是怎么回事啊！", "我：一个在家长蘑菇的人居然还会去书店！", "我：不过预感在书店又能遇见妹子了", "一下子没留意，与某样东西撞上了……", "？？：啊…啊…不好意思", "？？：你没事吧", "映入眼前的是一名文学少女", "我：没事，都怪我没好好走路", "？？：不过你刚都使出前列腺刹车了，需要救护车吗", "说着她便抄起手机准备打120", "我：真的没事了，按照剧情发展不如你把联系方式留给我", "我：不然这个选项就没意义了!", "？？：选项？忘了介绍自己了，我是33", "33：如果身体还疼的话别勉强自己啊", "我：嗯，那我先回家休息一下", "回到家，拿了快递", "我：我最近好像没清过购物车啊", "我：这份快递是……？", "我：BML门票？还是两张", "我：会不会是发错了", "我：后面还有张纸条——", "「收到这份礼物的你，不要担心，这份快递没有发错」", "「你是被选中的孩子，希望你能在BML中——」", "「享受愉悦，找到真爱」", "【那么问题来了，我要和谁去】"],
                                            role: ["", "2-4.png", "0-4.png", ""],
                                            roleChange: [1, 5, 9, 16],
                                            background: ["bg-street.jpg", "bg-room.jpg"],
                                            bgChange: [1, 16],
                                            choose: [{
                                                33: {
                                                    text: ["我忐忑不安地发了邀请的短息给33之后", "33回复说：嗯嗯可以的，33第一次被约出来呢 （////）", "于是在热得让人窒息的这一天", "我和33一起来到了BML现场", "演出很精彩", "但是我目光不光只是注视着舞台", "坐在我身旁的33", "平时看上去很文静的她", "看到这样的表演也不禁挥动手中的荧光棒", "我心中油然而生一种幸福感", "33：演出，太棒了", "我：嗯的确非常的赞", "33：话说，我们在五个月前是不是见过？", "（她当时在地铁站发现我了？）", "我：我记得读书的时候在地铁站看到了你", "我：我在原地呆滞了好久，完全被你吸引住了", "33：那个…过两周有个夏日祭典", "33：我想，和你一起去…", "我：好呀，能和你一起我觉得很开心", "夏夜祭典，如期而至", "我和她，也如期相见", "我：有个人说过，夏夜是一年中最浪漫的夜晚", "我：今晚居然能见到久违的星空", "今晚的夏季大三角特别的明显", "33：看到了吗，牛郎星和织女星", "33：今天七夕可是他们相见的日子呢", "我：那么，你愿意成为我的织女星吗", "33：我不要和你相隔16光年", "33：……只要能陪在你身边就好了"],
                                                    role: ["", "1-5.png", "1-6.png"],
                                                    roleChange: [1, 7, 21],
                                                    background: ["bg-room.jpg", "bg-BML.jpg", "bg-night-sky.jpg"],
                                                    bgChange: [1, 3, 20],
                                                    end: {
                                                        title: "相依的星辰",
                                                        CG: "33.png",
                                                        endId: "71045"
                                                    }
                                                },
                                                "自己一个人去就好了": {
                                                    text: ["我也没太多认识的朋友", "这些机会并不属于我", "于是我其中一张票卖掉了", "独自来到BML的我，万万没想到", "坐在我旁边的两位竟然是妹子", "而且似乎还是我认识的", "难道这就是命运吗", "我：你好，你一个人来的吗？", "33：姐姐，有人向我搭讪诶……", "22：你是谁！找我妹妹干嘛！", "我：这位姐姐冷静一下，我……我是个好人……", "我：看着你们都很会打call，所以想请教一下这位可爱的妹妹", "（总觉得见过她们其中一个…不过不在意这些细节了）", "22：这男生看着应该也不是什么坏人，那就跟着我们吧", "33：嗯嗯，那我们来教你…", "之后，我们就越聊越投机，甚至还相互交换了联系方式", "从此之后，每天跟22、33分别聊天成了我一天的重要事情家里", "她们的好感度以肉眼可见的速度上涨", "一只无形的手让我做出了一件大胆的事——", "约她们一起出来", "我：（说好的约出来呢，怎么就在我家了！）", "22：为什么33也在这里！", "33：姐姐也被约出来了吗？", "我：那个……", "等待着最终审判的我，试探性地插了句话", "22：真是差劲呢，竟然想把我们都把到！", "33：姐姐，我们要怎么办", "【我该怎么做】"],
                                                    role: ["", "2-5.png", "1-2.png", "0-5.png", "", "1-3.png", "2-6.png", "1-3.png", "2-6.png"],
                                                    roleChange: [1, 9, 10, 15, 16, 22, 23, 26, 27],
                                                    background: ["bg-BML.jpg", "bg-room.jpg"],
                                                    bgChange: [1, 17],
                                                    choose: [{
                                                        "花言巧语应对": {
                                                            text: ["我：你们听我说，你们都很可爱", "我：我不忍心在你们之中抛弃任何一个", "我：要不我们一起生活下去吧", "我：我会照顾好你们的！", "22：我怀疑你这里有问题", "33：姐姐，他说得好有道理", "33：我们还是把他推了吧", "我：你们想要……？", "我：啊啊啊……！"],
                                                            role: ["2-3.png", "0-6.png"],
                                                            roleChange: [5, 6],
                                                            background: ["bg-room.jpg"],
                                                            bgChange: [1],
                                                            end: {
                                                                title: "最终审判",
                                                                CG: "2233play.jpg",
                                                                endId: "71048"
                                                            }
                                                        },
                                                        "伺机逃跑": {
                                                            text: ["抓住了她们沉思的一瞬间", "我准备一个横跳冲到的房门", "这时候——", "烧水的水壶鸣叫了起来", "我：（这场景咋这么有既视感）", "我的身体感到了危机感", "然而——", "家里杂物太多了，一个不小心被绊倒在地", "22：啧啧啧，居然还想逃跑", "33：那你就别怪我们了…", "我：啊啊啊，不要阿……！"],
                                                            role: ["", "2-3.png", "0-6.png"],
                                                            roleChange: [1, 9, 10],
                                                            background: ["bg-room.jpg"],
                                                            bgChange: [1],
                                                            end: {
                                                                title: "最终审判",
                                                                CG: "2233play.jpg",
                                                                endId: "71048"
                                                            }
                                                        }
                                                    }]
                                                }
                                            }]
                                        }
                                    }]
                                }
                            }]
                        }
                    }]
                },
                "偷偷用手机拍张照片": {
                    text: ["刚亮起屏幕，手机就提示你附近有一只皮卡丘能抓", "然而，这时候——", "手机没电了", "我：……", "靠盃啊，你搞得一塌糊涂，就像你做的任何事一样", "这手机仿佛就是你的人生写照", "拍不到妹子，也抓不到皮卡丘", "也没有人爱你"],
                    role: [],
                    roleChange: [],
                    background: ["bg-subway-station.jpg"],
                    bgChange: [1],
                    end: {
                        title: "孤独一生",
                        CG: "",
                        endId: "71042"
                    }
                }
            }]
        }
    }]
};
$(function() {
    var e = {
        baseUrl: "http://www.bilibili.com/plus/widget/missionQixi.php?mission=32",
        imgBaseUrl: "./img/",
        $main: $("div.main-container"),
        $gameWrap: $("div.game-wrap"),
        $selectWrap: $("div.select-branch"),
        $surpriseWrap: $("div.show-surprise-wrap"),
        $endWrap: $("div.end-show-wrap"),
        $mask: $("div.mask"),
        $girl: $(".girls-show"),
        $text: $("div.text-content p"),
        $dialogue: $(".dialogue"),
        $speedUp: $(".speed-up"),
        way: {},
        nowText: {},
        textStep: 0,
        hasBG: !0,
        firstStep: !0,
        canDo: !0,
        count: 1,
        speed: 60,
        dataText: DATA,
        startGame: function() {
            var e, g = this, n = $(".btn-start"), t = $(".start-wrap"), o = $(".btn-play-again");
            return e = function() {
                t.show(),
                g.$main.addClass("bg-start"),
                g.$gameWrap.removeAttr("style").removeClass().addClass("game-wrap hidden").hide(),
                g.$text.html(""),
                g.$selectWrap.empty(),
                g.$mask.hide(),
                g.$dialogue.show(),
                g.$speedUp.hide(),
                g.$endWrap.hide(),
                g.nowText = {},
                g.textStep = 0,
                g.firstStep = !0,
                g.canDo = !0,
                g.hasBG = !0,
                g.$speedUp.html("加速"),
                g.count = 1,
                g.speed = 60,
                window.browser.version.iPad && g.$main.removeClass("bg-iPad")
            }
            ,
            n.on("click", function() {
                t.hide(),
                g.$speedUp.fadeIn(),
                g.$main.removeClass("bg-start"),
                g.$gameWrap.css("background-image", "url('./img/bg-street.jpg')").fadeIn(),
                g.$text.html(g.dataText.text[0]),
                g.nowText = g.dataText,
                window.browser.version.iPad && g.$main.addClass("bg-iPad")
            }),
            o.on("click", function() {
                e()
            }),
            this
        },
        _surprise: function() {
            var e, g, n = this, t = $(".show-surprise"), o = $(".surprise"), r = ["surprise1.png", "surprise2.png", "surprise3.png", "surprise4.png"];
            t.toggle(function() {
                e = Math.floor(4 * Math.random()),
                g = "url(" + n.imgBaseUrl + r[e] + ")",
                o.css("background-image", g).fadeIn()
            }, function() {
                o.hide()
            })
        },
        _cacheImg: function(e) {
            var g = this;
            "undefined" != typeof e.role && "" != e.role && $.each(e.role, function(n, t) {
                $("<img>").attr("src", g.imgBaseUrl + e.role[n])
            }),
            "undefined" != typeof e.end && "" != e.end && $("<img>").attr("src", g.imgBaseUrl + e.end.CG)
        },
        chooseWay: function() {
            var e = this;
            return e.$selectWrap.on("click", function(g) {
                var n = g.target ? g.target : g.srcElement
                  , t = $(n)
                  , o = t.html();
                $.each(e.nowText.choose, function(g, n) {
                    $.each(n, function(g, n) {
                        return o == g ? (e.$mask.hide(),
                        e.$selectWrap.fadeOut().empty(),
                        e.nowText = n,
                        e.textStep = 0,
                        e.firstStep = !0,
                        e.hasBG = !1,
                        e._branchStep(e.nowText, e.textStep),
                        !1) : void 0
                    })
                }),
                e._cacheImg(e.nowText)
            }),
            this
        },
        _branchStep: function(e, g) {
            var n, t, o = this, r = e.text ? e.text : "", a = r.length ? r.length : 0;
            if (n = function(n) {
                var t = "";
                n ? $.each(e.bgChange, function(n, r) {
                    var a = parseInt(e.bgChange[n] - 1);
                    g == a && (t = "url(" + (o.imgBaseUrl + e.background[n]) + ")",
                    o.$gameWrap.css("background-image", t))
                }) : (t = "url(" + (o.imgBaseUrl + e.background[0]) + ")",
                o.$gameWrap.css("background-image", t)),
                o.hasBG = !0,
                "bg-subway-station.jpg" == e.background[0] ? (o.$surpriseWrap.show(),
                o._surprise()) : o.$surpriseWrap.hide()
            }
            ,
            t = function() {
                o.$text.html(r[g].substring(0, s++)),
                s > r[g].length && (clearInterval(c),
                o.canDo = !0)
            }
            ,
            g >= a) {
                if ("undefined" != typeof e.choose && "" != e.choose) {
                    var p, d;
                    $.each(e.choose, function(e, g) {
                        $.each(g, function(e, g) {
                            d = '<div class="select-item">' + e + "</div>",
                            o.$selectWrap.append(d)
                        })
                    }),
                    p = "-" + o.$selectWrap.height() / 2 + "px",
                    o.$selectWrap.css({
                        top: "50%",
                        "margin-top": p
                    }),
                    o.$selectWrap.fadeIn(),
                    o.$mask.show()
                } else if ("undefined" != typeof e.end && "" != e.end) {
                    var i = e.end.endId
                      , l = e.end.title
                      , b = e.end.CG
                      , h = $(".btn-download");
                    "" == b ? (b = "javascript:;",
                    o.$gameWrap.css({
                        "background-image": "url('./img/no-CG-end.jpg')",
                        "background-color": "#000"
                    }),
                    h.find("img").attr("src", "./img/noCG-button.png")) : (o.$gameWrap.css("background-image", "url(" + o.imgBaseUrl + b.substring(0, b.indexOf(".")) + ".jpg_BG)"),
                    b = o.imgBaseUrl + b,
                    h.find("img").attr("src", "./img/CG-button.png"));
                    if (false) {
						$.ajax({
							url: "http://www.bilibili.com/plus/widget/missionQixi.php?act=getone&&mission=32&id=" + i,
							type: "GET",
							dataType: "json",
							success: function(e) {
								o.$endWrap.show().find(".end-title").html(l).end().find(".js-title").text(l).end().find(".strong-text").text(e.data.zan).end().find(".btn-download").attr("href", b).end(),
								o._share(),
								$.ajax({
									url: o.baseUrl + "&act=zan",
									type: "POST",
									dataType: "json",
									data: {
										id: i
									}
								})
							},
							error: function() {}
						});
                    } else {
						o.$endWrap.show().find(".end-title").html(l).end().find(".js-title").text(l).end().find(".strong-text").text("e.data.zan").end().find(".btn-download").attr("href", b).end();
						o._share();
                    }
                    o.$dialogue.hide(),
                    o.$speedUp.hide(),
                    o.$girl.hide(),
                    o.$surpriseWrap.hide().find(".surprise").hide()
                }
            } else if ("undefined" != typeof a && "" != a)
                var s = 0
                  , c = setInterval(t, o.speed);
            return "" != e.role ? $.each(e.roleChange, function(n, t) {
                var r = parseInt(e.roleChange[n] - 1);
                if (g == r)
                    if ("" == e.role[n])
                        o.$girl.hide();
                    else {
                        var a = o.imgBaseUrl + e.role[n];
                        "3-1.png" == e.role[n] || "3-2.png" == e.role[n] || "3-3.png" == e.role[n] ? o.$girl.addClass("TV-show") : o.$girl.removeClass("TV-show"),
                        o.$girl.fadeIn().attr("src", a)
                    }
            }) : o.$girl.hide(),
            "" != e.background && "undefined" != typeof e.bgChange && "" != e.bgChange ? n(!0) : "" != e.background && 0 == o.hasBG && n(),
            this
        },
        nextStep: function() {
            var e = this;
            return e.$gameWrap.off().on("click", function(g) {
                g.stopPropagation(),
                e.canDo && (e.firstStep && (e.textStep = 1,
                e.firstStep = !1),
                e.canDo = !1,
                e._branchStep(e.nowText, e.textStep),
                e.textStep++)
            }),
            this
        },
        accelerate: function() {
            var e, g = this;
            return e = function(e, n) {
                g.speed = e,
                g.$speedUp.html(n),
                1 == g.count ? g.count = 0 : g.count++
            }
            ,
            g.$speedUp.on("click", function() {
                switch (g.count) {
                case 0:
                    e(60, "加速");
                    break;
                case 1:
                    e(20, "加速 x 1")
                }
            }),
            this
        },
        addBgImg: function() {
            var e = this
              , g = ["bg-room.jpg", "bg-night-sky.jpg", "bg-PAD.jpg", "bg-street.jpg", "bg-subway-station.jpg", "bg-BML.jpg", "bg-CVS.jpg", "no-CG-end.jpg"];
            return $.each(g, function(n, t) {
                $("<img>").attr("src", e.imgBaseUrl + g[n])
            }),
            this
        },
        _share: function() {
            var e = $(".btn-share")
              , g = ["./img/share1.jpg", "./img/share2.jpg"]
              , n = "./activity-qixi2016.html"
              , t = "Bilibili七夕之约"
              , o = "七夕佳节，一起来攻略22、33吧 (o′ω`o) "
              , r = Math.floor(2 * Math.random())
              , a = {
                title: t,
                desc: o,
                link: n,
                pics: g[r]
            };
            e.off().biliShareMobile({
                share: a
            }).biliShareMobile("setShareContent", a)
        },
        init: function() {
            var e = this;
            e.startGame().chooseWay().nextStep().accelerate().addBgImg()
        }
    };
    window.onload = function() {
        e.init(),
        setTimeout(function() {
            $("div.game-loading").hide()
        }, 1e3)
    }
});
